tap "anomalyco/tap"
tap "cesarferreira/tap"
tap "charmbracelet/tap"
tap "fairwindsops/tap"
tap "felixkratz/formulae"
tap "hashicorp/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "psviderski/tap"
tap "puma/puma"
tap "qmk/qmk"
tap "rtk-ai/tap"
tap "st0012/cctop"
tap "steipete/tap"
tap "stripe/stripe-cli"
tap "tw93/tap"
tap "vitobotta/tap"

brew "act"
brew "xz"
brew "atuin"
brew "autoconf"
brew "autoconf-archive"
brew "automake"
brew "bat"
brew "bc"
brew "readline"
brew "bind"
brew "bison"
brew "btop"
brew "ccache"
brew "clippy"
brew "cloudflared"
brew "cmake"
brew "container"
brew "coreutils"
brew "difftastic"
brew "dua-cli"
brew "ffmpeg"
brew "flyctl"
brew "fzf"
brew "gdbm"
brew "gh"
brew "git"
brew "go"
brew "hadolint"
brew "helm"
brew "imagemagick"
brew "irssi"
brew "jq"
brew "k6"
brew "k9s"
brew "lazygit"
brew "libffi"
brew "libvirt", restart_service: :changed
brew "libxml2"
brew "libyaml"
brew "llvm@19"
brew "ls-lint"
brew "lua-language-server"
brew "mas"
brew "mcfly"
brew "minikube"
brew "mise"
brew "mysql@8.4"
brew "nasm"
brew "neovim"
brew "sqlite", link: true
brew "netshow"
brew "ninja"
brew "nmap"
brew "node@24"
brew "oha"
brew "openssl@3.5"
brew "tmux"
brew "overmind"
brew "pkgconf"
brew "qemu"
brew "qt"
brew "ripgrep"
brew "rust"
brew "rustup"
brew "shellcheck"
brew "shellharden"
brew "spotify_player"
brew "sqruff"
brew "sshpass"
brew "starship"
brew "stow"
brew "stylua"
brew "tailscale"
brew "taplo"
brew "television"
brew "tidy-html5"
brew "topgrade"
brew "tree"
brew "tree-sitter"
brew "typos-cli"
brew "typos-lsp"
brew "valkey", restart_service: :changed
brew "watchman"
brew "wb32-dfu-updater_cli"
brew "wget"
brew "witr"
brew "yamlfmt"
brew "yamllint"
brew "yazi"
brew "yq"
brew "zellij"
brew "anomalyco/tap/opencode"
brew "cesarferreira/tap/rip"
brew "fairwindsops/tap/nova"
brew "hashicorp/tap/terraform"
brew "puma/puma/puma-dev"
brew "qmk/qmk/qmk"
brew "rtk-ai/tap/rtk"
brew "stripe/stripe-cli/stripe"
brew "tw93/tap/mole"
brew "vitobotta/tap/hetzner_k3s"

cask "airbuddy"
cask "balenaetcher"
cask "betterdisplay"
cask "st0012/cctop/cctop"
cask "claude"
cask "steipete/tap/codexbar"
cask "elgato-stream-deck"
cask "font-cascadia-code-nf"
cask "font-caskaydia-cove-nerd-font"
cask "font-caskaydia-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-manufacturing-consent"
cask "font-maple-mono-nf"
cask "font-maple-mono-normal-nf"
cask "hot"
cask "imageoptim"
cask "launchos"
cask "mac-mouse-fix"
cask "macfuse"
cask "ngrok"
cask "nvidia-geforce-now"
cask "omnidisksweeper"
cask "qmk-toolbox"
cask "sqlitestudio"
cask "the-unarchiver"
cask "via"
cask "vlc"

mas "Balance Lock", id: 1019371109
mas "Dato", id: 1470584107
mas "Discovery", id: 1381004916
mas "Itsyhome", id: 6758070650
mas "Tailscale", id: 1475387142
mas "The Unarchiver 2", id: 425424353
