tap "alienator88/cask"
tap "felixkratz/formulae"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "puma/puma"
tap "stripe/stripe-cli"

brew "xz"
brew "automake"
brew "bat"
brew "bc"
brew "readline"
brew "bind"
brew "bison"
brew "btop"
brew "cloudflare-wrangler"
brew "cloudflared"
brew "coreutils"
brew "difftastic"
brew "direnv"
brew "dua-cli"
brew "sqlite", link: true
brew "ffmpeg"
brew "flyctl"
brew "fzf"
brew "gdbm"
brew "gh"
brew "git"
brew "go"
brew "hadolint"
brew "hey"
brew "imagemagick"
brew "irssi"
brew "jq"
brew "k6"
brew "lazygit"
brew "libffi"
brew "libvirt", restart_service: :changed
brew "libxml2"
brew "libyaml"
brew "lua-language-server"
brew "mas"
brew "mcfly"
brew "mise"
brew "neofetch"
brew "neovim"
brew "nmap"
brew "oha"
brew "openssl@1.1"
brew "tmux"
brew "overmind"
brew "pkgconf"
brew "ripgrep"
brew "shellcheck"
brew "shellharden"
brew "spotify_player"
brew "sshpass"
brew "starship"
brew "stow"
brew "stylua"
brew "tailscale"
brew "television"
brew "tidy-html5"
brew "topgrade"
brew "tree"
brew "typos-cli"
brew "typos-lsp"
brew "valkey", restart_service: :changed
brew "watchman"
brew "wget"
brew "yamlfmt"
brew "yamllint"
brew "youtube-dl"
brew "yq"
brew "zellij"
brew "hashicorp/tap/terraform"
brew "puma/puma/puma-dev"

brew "stripe/stripe-cli/stripe"
cask "airbuddy"
cask "cloudflare-warp"
cask "cryptomator"
cask "discord"
cask "dropbox"
cask "font-cascadia-code-nf"
cask "font-fira-code-nerd-font"
cask "font-maple-mono-nf"
cask "font-maple-mono-normal-nf"
cask "hot"
cask "mac-mouse-fix"
cask "ngrok"
cask "notion"
cask "nvidia-geforce-now"
cask "omnidisksweeper"
cask "orbstack"
cask "pearcleaner"
cask "rectangle"
cask "slack"
cask "sqlitestudio"
cask "the-unarchiver"
cask "via"
cask "vlc"
cask "youtube-to-mp3"
cask "yubico-yubikey-manager"

mas "Balance Lock", id: 1019371109
mas "Dato", id: 1470584107
mas "Discovery", id: 1381004916
mas "Tailscale", id: 1475387142
