tap "charmbracelet/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "puma/puma"
tap "qmk/qmk"

brew "automake"
brew "aws-nuke"
brew "bat"
brew "bison"
brew "btop"
brew "readline"
brew "sqlite", link: true
brew "python@3.12"
brew "coreutils"
brew "docker-buildx"
brew "dua-cli"
brew "ffmpeg"
brew "fzf"
brew "gdbm"
brew "gh"
brew "git"
brew "git-delta"
brew "go"
brew "hadolint"
brew "hey"
brew "imagemagick"
brew "irssi"
brew "jq"
brew "k6"
brew "lazygit"
brew "libffi"
brew "libvirt"
brew "libxml2"
brew "libyaml"
brew "lua-language-server"
brew "mas"
brew "mcfly"
brew "mysql"
brew "neofetch"
brew "neovim"
brew "oha"
brew "openssl@1.1"
brew "tmux"
brew "overmind"
brew "rbenv"
brew "redis", restart_service: true
brew "ripgrep"
brew "shellcheck"
brew "shellharden"
brew "spotify_player"
brew "starship"
brew "stylua"
brew "superfile"
brew "tidy-html5"
brew "topgrade"
brew "typos-cli"
brew "watchman"
brew "wb32-dfu-updater_cli"
brew "wget"
brew "yamllint"
brew "yarn"
brew "youtube-dl"
brew "zellij"
brew "charmbracelet/tap/freeze"
brew "hashicorp/tap/terraform"
brew "puma/puma/puma-dev"
brew "qmk/qmk/qmk"

cask "airbuddy"
cask "appcleaner"
cask "chatgpt"
cask "cloudflare-warp"
cask "cryptomator"
cask "discord"
cask "dropbox"
cask "font-cascadia-code-nf"
cask "font-fira-code-nerd-font"
cask "font-juliamono"
cask "font-monaspace"
cask "font-mononoki-nerd-font"
cask "font-protest-revolution"
cask "font-protest-strike"
cask "font-zed-mono"
cask "font-zed-sans"
cask "google-chrome"
cask "hammerspoon"
cask "hot"
cask "mac-mouse-fix"
cask "ngrok"
cask "notion"
cask "nvidia-geforce-now"
cask "omnidisksweeper"
cask "orbstack"
cask "postico"
cask "qmk-toolbox"
cask "rectangle"
cask "slack"
cask "sqlitestudio"
cask "the-unarchiver"
cask "turbovnc-viewer"
cask "via"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "youtube-to-mp3"
cask "yubico-yubikey-manager"

mas "Balance Lock", id: 1019371109
mas "Bitwarden", id: 1352778147
mas "Dato", id: 1470584107
mas "GIPHY CAPTURE", id: 668208984
mas "iMovie", id: 408981434
mas "Spark", id: 1176895641
mas "ToDoBar", id: 1641624925
